waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Src/fm33fk5xx_fl_adc.c
/**
  ****************************************************************************************************
  * @file    fm33fk5xx_fl_adc.c
  * @author  FMSH Application Team
  * @brief   Src file of ADC FL Module
  ****************************************************************************************************
  * @attention
  *
  * Copyright (c) [2021] [Fudan Microelectronics]
  * THIS SOFTWARE is licensed under Mulan PSL v2.
  * You can use this software according to the terms and conditions of the Mulan PSL v2.
  * THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND,
  * EITHER EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT,
  * MERCHANTABILITY OR FIT FOR A PARTICULAR PURPOSE.
  * See the Mulan PSL v2 for more details.
  *
  ****************************************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "fm33fk5xx_fl.h"

/** @addtogroup fm33fk5xx_FL_Driver
  * @{
  */

/** @addtogroup ADC
  * @{
  */

#ifdef FL_ADC_DRIVER_ENABLED

/* Private macros ------------------------------------------------------------*/
/** @addtogroup ADC_FL_Private_Macros
  * @{
  */

#define         IS_FL_ADC_INSTANCE(INSTANCE)                ((INSTANCE) == ADC)

#define         IS_FL_ADC_CLK_SOURCE(__VALUE__)             (((__VALUE__) == FL_CMU_ADC_CLK_SOURCE_APBCLK)||\
                                                            ((__VALUE__) == FL_CMU_ADC_CLK_SOURCE_RCHF)||\
                                                            ((__VALUE__) == FL_CMU_ADC_CLK_SOURCE_XTHF)||\
                                                            ((__VALUE__) == FL_CMU_ADC_CLK_SOURCE_PLL))

#define         IS_FL_ADC_REFERENCE_SOURCE(__VALUE__)       (((__VALUE__) == FL_ADC_REF_SOURCE_VDDA)||\
                                                            ((__VALUE__) == FL_ADC_REF_SOURCE_VREFP))

#define         IS_FL_ADC_TRIGERMODE(__VALUE__)             (((__VALUE__) == FL_ADC_TRIGER_MODE_NOMAL)||\
                                                            ((__VALUE__) == FL_ADC_TRIGER_MODE_ONE_SHOT)||\
                                                            ((__VALUE__) == FL_ADC_TRIGER_MODE_CONTINUOUS))

#define         IS_FL_ADC_CONVERSIONMODE(__VALUE__)             (((__VALUE__) == FL_ADC_SYNC_MODE_SYNC)||\
                                                            ((__VALUE__) == FL_ADC_SYNC_MODE_ASYNC))

#define         IS_FL_ADC_WAITCOFIG(__VALUE__)                  (((__VALUE__) == FL_DISABLE)||\
                                                            ((__VALUE__) == FL_ENABLE))

#define         IS_FL_ADC_OVERRUNCOFIG(__VALUE__)           (((__VALUE__) == FL_DISABLE)||\
                                                            ((__VALUE__) == FL_ENABLE))

#define         IS_FL_ADC_CHANNELSELECT(__VALUE__)          (((__VALUE__) == FL_ADC_ACQ_SELECT_CHANNEL_INA0)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_SELECT_CHANNEL_INA1)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_SELECT_CHANNEL_INA2)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_SELECT_CHANNEL_INA3)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_SELECT_CHANNEL_INA4)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_SELECT_CHANNEL_INA5)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_SELECT_CHANNEL_INA6)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_SELECT_CHANNEL_INA7)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_SELECT_CHANNEL_INA8_OPA0_OUT)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_SELECT_CHANNEL_TS)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_SELECT_CHANNEL_AVREF)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_SELECT_CHANNEL_P_CALIBRATION)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_SELECT_CHANNEL_INB0)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_SELECT_CHANNEL_INB1)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_SELECT_CHANNEL_INB2)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_SELECT_CHANNEL_INB3)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_SELECT_CHANNEL_INB4)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_SELECT_CHANNEL_INB5)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_SELECT_CHANNEL_INB6)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_SELECT_CHANNEL_INB7)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_SELECT_CHANNEL_INB8_OPA1_OUT)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_SELECT_CHANNEL_VBAT_DIV3)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_SELECT_CHANNEL_DAC0)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_SELECT_CHANNEL_N_CALIBRATION))

#define         IS_FL_ADC_TRIGSOURCE(__VALUE__)                     (((__VALUE__) == FL_ADC_ACQ_TRGI_SOFE_TRG)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_TRGI_LUT0_TRG)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_TRGI_LUT1_TRG)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_TRGI_LUT2_TRG)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_TRGI_LUT3_TRG)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_TRGI_ATIM0_TRGO)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_TRGI_ATIM1_TRGO)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_TRGI_ATIM0_TRGO2)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_TRGI_ATIM1_TRGO2)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_TRGI_GPTIM0_TRGO)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_TRGI_GPTIM1_TRGO)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_TRGI_GPTIM2_TRGO)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_TRGI_EPWM0SOCA)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_TRGI_EPWM1SOCA)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_TRGI_EPWM1SOCB)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_TRGI_EPWM2SOCA)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_TRGI_EPWM2SOCB)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_TRGI_EPWM3SOCA)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_TRGI_EPWM3SOCB)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_TRGI_COMP0_TRGO)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_TRGI_COMP1_TRGO)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_TRGI_COMP2_TRGO)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_TRGI_LPTIM0_TRGO)||\
                                                            ((__VALUE__) == FL_ADC_ACQ_TRGI_BSTIM0_TRGO))

